{
  "backend/main.mo": "Motoko backend with access-controlled user profiles and per-user pattern storage, including save/load operations.",
  "feature_evidence.json": "Feature evidence report mapping features to related frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "List of prewritten 1–2 sentence summaries for various frontend files.",
  "frontend/index.css": "Tailwind base styles and OKLCH color variables defining the retro-funk theme for light/dark modes.",
  "frontend/index.html": "Base HTML entry point loading the React app via main.tsx.",
  "frontend/src/App.tsx": "Wraps the app with theme provider and renders the sequencer workspace plus profile dialog and toaster.",
  "frontend/src/audio/drumVoices.ts": "Implements synthesized kick, snare, hi-hat, and clap voices using Web Audio API oscillators, noise, filters, and envelopes.",
  "frontend/src/audio/useSequencerAudio.ts": "React hook providing sequencer playback with scheduling, per-step triggering, BPM control, and Web Audio integration.",
  "frontend/src/components/auth/LoginButton.tsx": "Authentication button handling Internet Identity login/logout with query cache clearing and error fallback logic.",
  "frontend/src/components/auth/ProfileSetupDialog.tsx": "Modal prompting new authenticated users to enter and save their display name.",
  "frontend/src/components/help/HelpPanel.tsx": "Static help content describing beat creation, pattern management, saving, and tips.",
  "frontend/src/components/layout/AppHeader.tsx": "Top navigation bar with logo, help dialog, user name display, and login button.",
  "frontend/src/components/layout/AppShell.tsx": "Layout wrapper providing background, header, main content area, and footer.",
  "frontend/src/components/patterns/CloudSaveLoadPanel.tsx": "Authenticated UI for saving the active pattern to the cloud and loading saved patterns.",
  "frontend/src/components/patterns/PatternManager.tsx": "Manages pattern selection, creation, and renaming within the local session.",
  "frontend/src/components/sequencer/SequencerWorkspace.tsx": "Main sequencer workspace coordinating pattern editing, playback, and save/load panels.",
  "frontend/src/components/sequencer/StepGrid.tsx": "Interactive 16‑step grid allowing toggling of steps for each track with current-step highlighting.",
  "frontend/src/components/sequencer/TrackList.tsx": "Displays track names with mute and volume controls for each instrument track.",
  "frontend/src/components/sequencer/TransportControls.tsx": "Play/stop button and BPM controls for the sequencer transport.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor based on Internet Identity, refreshing dependent queries when the identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an Internet Identity auth context with login, logout, and stored delegation handling.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks to load, save, and manage user profiles and musical patterns through the backend actor.",
  "frontend/src/index.css": "Sets Tailwind base styles and a custom retro color theme for light and dark modes.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and InternetIdentityProvider.",
  "frontend/src/state/usePatternSession.ts": "Zustand store managing local pattern state including creation, updates, loading, and active pattern selection.",
  "frontend/src/types/music.ts": "Defines music sequencer types and helpers for creating patterns and converting to and from backend formats.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, storing, and clearing URL and session-based parameters.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme colors, animations, and utilities using CSS variables.",
  "project_state.json": "Project configuration describing the Funk Maker app’s state, including existing features, image requirements, and metadata. Contains versioning info, feature definitions, and a pending new feature request."
}